<?php

/**
 * 3点を通る円の中心座標と半径を求める
 * 求まらない場合は[-1,-1,-1]を返す
 **/
function circleWith3Points($x1, $y1, $x2, $y2, $x3, $y3){
    //二辺のベクトルを出す
    $xd1 = $x2-$x1;
    $yd1 = $y2-$y1;
    $xd2 = $x3-$x1;
    $yd2 = $y3-$y1;
    
    //2点が同一であれば求めることはできない -- 3点指定しないと円を一意に特定できない
    if($x1 == $x2 && $y1 == $y2 || $x1 == $x3 && $y1 == $y3 || $x2 == $x3 && $y2 == $y3){
        return [-1,-1,-1];
    }
 
    list($xd1, $yd1, $xd2, $yd2) = [$yd1, -$xd1, $yd2, -$xd2];//90度回転させて法線にする
    //二辺の中点を求める
    $x12 = ($x1+$x2)/2;
    $x13 = ($x1+$x3)/2;
    $y12 = ($y1+$y2)/2;
    $y13 = ($y1+$y3)/2;
 
    //以上より2直線の方程式は以下のように表現できる
    // xd1(Y-y12) = yd1(X-x12)
    // xd2(Y-y13) = yd2(X-x13)
    //整理すると
    // - yd1 * X + xd1 * Y - xd1 * y12 + yd1 * x12 = 0
    // - yd2 * X + xd2 * Y - xd2 * y13 + yd2 * x13 = 0
    $a1 = - $yd1;
    $b1 =   $xd1;
    $c1 = - $xd1 * $y12 + $yd1 * $x12;
    $a2 = - $yd2;
    $b2 =   $xd2;
    $c2 = - $xd2 * $y13 + $yd2 * $x13;
    if($a1*$b2 - $a2*$b1 == 0){
        return [-1,-1,-1];
    }
    $x = ($b1*$c2 - $b2*$c1)/($a1*$b2 - $a2*$b1); 
    $y = ($a2*$c1 - $a1*$c2)/($a1*$b2 - $a2*$b1); 
    $r = sqrt(($x1-$x)**2 + ($y1-$y)**2);
    return [$x, $y, $r];
}
